---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.LinearMoment
source: html/6f9d47c9-a396-ae16-52ba-c1c0917ad6c2.htm
---
# Autodesk.Revit.DB.SpecTypeId.LinearMoment Property

Linear Moment, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId LinearMoment { get; }
```